Σ = [
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
    [1, 0, 0, 1, 0, 0, 0, 1, 0, 1],
    [1, 0, 0, 1, 0, 0, 0, 1, 0, 1],
    [1, 0, 0, 0, 0, 1, 1, 0, 0, 1],
    [1, 0, 1, 1, 1, 0, 0, 0, 0, 1],
    [1, 0, 0, 0, 1, 0, 0, 0, 0, 1],
    [1, 0, 1, 0, 0, 0, 1, 0, 0, 1],
    [1, 0, 1, 1, 1, 0, 1, 1, 0, 1],
    [1, 1, 0, 0, 0, 0, 0, 0, 0, 1],
    [1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
]
Δ = [[1, 0], [-1, 0], [0, 1], [0, -1]]
ℬ(p,ϵ) = [p + δ*ϵ for δ ∈ Δ]

function route(α, β)
    Γ = [α]
    function go()
        p = Γ[end]
        if p == β
            return true
        end
        for p ∈ ℬ(p,1)
            x, y = p
            if Σ[x][y] == 0 && p ∉ Γ
                Γ = [Γ;[p]]
                if go()
                    return true
                end
                Γ = Γ[1:end-1]
            end
        end
        return false
    end 
    go()
    return Γ
end

α = [2,2]
β = [9,9]
println(route(α, β))